d-e-e-p/stm32-spi-slave/spi_test/Core/Src/spi.cpp
  if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0U))
  {
    uprintf("PAL_SPI_TS: pTxData = pRxData = NULL:%d\n");
    errorcode = HAL_ERROR;
    goto error;
  }

  /* Don't overwrite in case of HAL_SPI_STATE_BUSY_RX */
  if (hspi->State != HAL_SPI_STATE_BUSY_RX)
  {
    hspi->State = HAL_SPI_STATE_BUSY_TX_RX;
  }

  /* Set the transaction information */
  hspi->ErrorCode   = HAL_SPI_ERROR_NONE;
  hspi->pRxBuffPtr  = (uint8_t *)pRxData;
  hspi->RxXferCount = Size;
  hspi->RxXferSize  = Size;
  hspi->pTxBuffPtr  = (uint8_t *)pTxData;
  hspi->TxXferCount = Size;
  hspi->TxXferSize  = Size;

  /*Init field not used in handle to zero */
  hspi->RxISR       = NULL;
  hspi->TxISR       = NULL;


  /* Check if the SPI is already enabled */
  if ((hspi->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
  {
    /* Enable SPI peripheral */
    __HAL_SPI_ENABLE(hspi);
  }

  {
    if ((hspi->Init.Mode == SPI_MODE_SLAVE) || (initial_TxXferCount == 0x01U))
    {
      *((__IO uint8_t *)&hspi->Instance->DR) = (*hspi->pTxBuffPtr);
      hspi->pTxBuffPtr += sizeof(uint8_t);
      hspi->TxXferCount--;
      uprintf("PAL_SPI_TS: TxXferCount =:%d\n", hspi->TxXferCount);
    }
    while ((hspi->TxXferCount > 0U) || (hspi->RxXferCount > 0U))
    {
      /* Check TXE flag */
      if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_TXE)) && (hspi->TxXferCount > 0U) && (txallowed == 1U))
      {
        *(__IO uint8_t *)&hspi->Instance->DR = (*hspi->pTxBuffPtr);
        hspi->pTxBuffPtr++;
        hspi->TxXferCount--;
        /* Next Data is a reception (Rx). Tx not allowed */
        txallowed = 0U;
        uprintf("PAL_SPI_TS: SPI_FLAG_TXE TxXferCount =:%d txallowed=%d\n", hspi->TxXferCount, txallowed);

      }

      /* Wait until RXNE flag is reset */
      if ((__HAL_SPI_GET_FLAG(hspi, SPI_FLAG_RXNE)) && (hspi->RxXferCount > 0U))
      {
        (*(uint8_t *)hspi->pRxBuffPtr) = hspi->Instance->DR;
        hspi->pRxBuffPtr++;
        hspi->RxXferCount--;
        /* Next Data is a Transmission (Tx). Tx is allowed */
        txallowed = 1U;
        uprintf("PAL_SPI_TS: SPI_FLAG_RXNE RxXferCount =%d txallowed=%d\n", hspi->RxXferCount, txallowed);
      }
      if ((((HAL_GetTick() - tickstart) >=  Timeout) && ((Timeout != HAL_MAX_DELAY))) || (Timeout == 0U))
      {
        errorcode = HAL_TIMEOUT;
        uprintf("PAL_SPI_TS: ERROR TIMEOUT\n");
        goto error;
      }
    }
  }


  // TODO: skip check end of transaction
  /* Check the end of the transaction */
  if (SPI_EndRxTxTransaction(hspi, Timeout, tickstart) != HAL_OK)
  {
    errorcode = HAL_ERROR;
    hspi->ErrorCode = HAL_SPI_ERROR_FLAG;
    uprintf("PAL_SPI_TS: ERROR SPI_EndRxTxTransaction not ok\n");
    goto error;
  }

  /* Clear overrun flag in 2 Lines communication mode because received is not read */
  if (hspi->Init.Direction == SPI_DIRECTION_2LINES)
  {
    __HAL_SPI_CLEAR_OVRFLAG(hspi);
  }

error :
  hspi->State = HAL_SPI_STATE_READY;
  __HAL_UNLOCK(hspi);
  uprintf("spi error : %d\r\n", errorcode);
  return errorcode;

}


// Function to print the values of SPI_InitTypeDef
void printSPIConfig(SPI_InitTypeDef spiConfig) {
  printf("BaudRatePrescaler: %u\n", spiConfig.BaudRatePrescaler);
  printf("CLKPhase: %u\n", spiConfig.CLKPhase);
  printf("CLKPolarity: %u\n", spiConfig.CLKPolarity);
  printf("CRCCalculation: %u\n", spiConfig.CRCCalculation);
  printf("CRCPolynomial: %u\n", spiConfig.CRCPolynomial);
  printf("DataSize: %u\n", spiConfig.DataSize);
  printf("Direction: %u\n", spiConfig.Direction);
  printf("FirstBit: %u\n", spiConfig.FirstBit);
  printf("Mode: %u\n", spiConfig.Mode);
  printf("NSS: %u\n", spiConfig.NSS);
  printf("TIMode: %u\n", spiConfig.TIMode);
}

void printSPIStateDescription(HAL_SPI_StateTypeDef state) {
  switch (state) {
    case HAL_SPI_STATE_RESET:
      printf("SPI State: RESET\n");
    case HAL_SPI_STATE_READY:
      printf("SPI State: READY\n");
    case HAL_SPI_STATE_BUSY:
      printf("SPI State: BUSY\n");
    case HAL_SPI_STATE_BUSY_TX:
      printf("SPI State: BUSY_TX\n");
    case HAL_SPI_STATE_BUSY_RX:
      printf("SPI State: BUSY_RX\n");
    case HAL_SPI_STATE_BUSY_TX_RX:
      printf("SPI State: BUSY_TX_RX\n");
    case HAL_SPI_STATE_ERROR:
      printf("SPI State: ERROR\n");
    case HAL_SPI_STATE_ABORT:
      printf("SPI State: ABORT\n");
  }
}

// Function to print the values of SPI_TypeDef in hexadecimal format
void printSPIValuesHex(SPI_TypeDef spi) {
  printf("CR1: 0x%08X\n", spi.CR1);
  printf("CR2: 0x%08X\n", spi.CR2);
  printf("SR: 0x%08X\n", spi.SR);
  printf("DR: 0x%08X\n", spi.DR);
  printf("CRCPR: 0x%08X\n", spi.CRCPR);
  printf("RXCRCR: 0x%08X\n", spi.RXCRCR);
  printf("TXCRCR: 0x%08X\n", spi.TXCRCR);
  printf("I2SCFGR: 0x%08X\n", spi.I2SCFGR);
  printf("I2SPR: 0x%08X\n", spi.I2SPR);
}

// Function to get a string description for HAL_SPI_Error
const char* getSPIErrorDescription(uint32_t errorCode) {
  switch (errorCode) {
    case HAL_SPI_ERROR_NONE:
      return "No error";
    case HAL_SPI_ERROR_MODF:
      return "MODF error";
    case HAL_SPI_ERROR_CRC:
      return "CRC error";
    case HAL_SPI_ERROR_OVR:
      return "OVR error";
    case HAL_SPI_ERROR_FRE:
      return "FRE error";
    case HAL_SPI_ERROR_DMA:
      return "DMA transfer error";
    case HAL_SPI_ERROR_FLAG:
      return "Error on RXNE/TXE/BSY Flag";
    case HAL_SPI_ERROR_ABORT:
      return "Error during SPI Abort procedure";
    default:
      return "Unknown SPI Error";
  }
}


// Function to print the values of SPI_HandleTypeDef including nested structures
void printSPIHandle(SPI_HandleTypeDef spiHandle) {
  printf("SPI Handle:\n");
  printf("Instance: %p\n", (void*)spiHandle.Instance);
  printSPIValuesHex(* (spiHandle.Instance));

  printf("SPI_InitTypeDef:\n");
  printSPIConfig(spiHandle.Init);

  printf("pTxBuffPtr: %p\n", (void*)spiHandle.pTxBuffPtr);
  printf("TxXferSize: %u\n", spiHandle.TxXferSize);
  printf("TxXferCount: %u\n", spiHandle.TxXferCount);

  printf("pRxBuffPtr: %p\n", (void*)spiHandle.pRxBuffPtr);
  printf("RxXferSize: %u\n", spiHandle.RxXferSize);
  printf("RxXferCount: %u\n", spiHandle.RxXferCount);

  printf("State: \n"); 
  printSPIStateDescription(spiHandle.State);
  printf("ErrorCode: 0x%08X\n", spiHandle.ErrorCode);
  printf("ErrorCode: %s\n", getSPIErrorDescription(spiHandle.ErrorCode));
}

